; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_7)
(:domain joint_bar)
(:objects
    link1 link2 link3 - link
    angle0 angle30 angle60 angle90 angle120 angle150 angle180 angle210 angle240 angle270 angle300 angle330 - angle)
(:init
    (AngleOrd angle0 angle30)
    (AngleOrd angle30 angle60)
    (AngleOrd angle60 angle90)
    (AngleOrd angle90 angle120)
    (AngleOrd angle120 angle150)
    (AngleOrd angle150 angle180)
    (AngleOrd angle180 angle210)
    (AngleOrd angle210 angle240)
    (AngleOrd angle240 angle270)
    (AngleOrd angle270 angle300)
    (AngleOrd angle300 angle330)
    (AngleOrd angle330 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)

    (HasAngle angle90 link1)
    (HasAngle angle30 link2)
    (HasAngle angle270 link3)
)
(:goal
(and
    (HasAngle angle150 link1)
    (HasAngle angle300 link2)
    (HasAngle angle210 link3)
    )
)
)

; plan
1. (increase_angle link1 angle90 angle120)
   deleted: (hasangle angle90 link1) (hasangle angle30 link2) (hasangle angle270 link3)
   added: (hasangle angle120 link1) (hasangle angle60 link2) (hasangle angle300 link3)
   goals met: 0 of 3
2. (increase_angle link1 angle120 angle150)
   deleted: (hasangle angle120 link1) (hasangle angle60 link2) (hasangle angle300 link3)
   added: (hasangle angle150 link1) (hasangle angle90 link2) (hasangle angle330 link3)
   goals met: 1 of 3
3. (decrease_angle link2 angle90 angle60)
   deleted: (hasangle angle90 link2) (hasangle angle330 link3)
   added: (hasangle angle60 link2) (hasangle angle300 link3)
   goals met: 1 of 3
4. (decrease_angle link2 angle60 angle30)
   deleted: (hasangle angle60 link2) (hasangle angle300 link3)
   added: (hasangle angle30 link2) (hasangle angle270 link3)
   goals met: 1 of 3
5. (decrease_angle link2 angle30 angle0)
   deleted: (hasangle angle30 link2) (hasangle angle270 link3)
   added: (hasangle angle0 link2) (hasangle angle240 link3)
   goals met: 1 of 3
6. (decrease_angle link2 angle0 angle330)
   deleted: (hasangle angle0 link2) (hasangle angle240 link3)
   added: (hasangle angle330 link2) (hasangle angle210 link3)
   goals met: 2 of 3
7. (decrease_angle link2 angle330 angle300)
   deleted: (hasangle angle330 link2) (hasangle angle210 link3)
   added: (hasangle angle300 link2) (hasangle angle180 link3)
   goals met: 2 of 3
8. (increase_angle link3 angle180 angle210)
   deleted: (hasangle angle180 link3)
   added: (hasangle angle210 link3)
   goals met: 3 of 3
